In [48]:
import pandas as pd
import datetime

In [16]:
d = {'col1': [1, 2], 'col2': [3.5, 4.5],'col3':["a","a"]}
df = pd.DataFrame(data=d)
df

   col1  col2 col3
0     1   3.5    a
1     2   4.5    a

In [17]:
df.dtypes

col1      int64
col2    float64
col3     object
dtype: object

In [25]:
df = pd.read_csv('financial-data.csv')

In [28]:
df.tail()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
5950,BDCQ.SF8RSCA,2021.06,635.931,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
5951,BDCQ.SF8RSCA,2021.09,382.195,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
5952,BDCQ.SF8RSCA,2021.12,397.184,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
5953,BDCQ.SF8RSCA,2022.03,493.945,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN
5954,BDCQ.SF8RSCA,2022.06,613.758,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 1),Operating profit,"Arts, Recreation and Other Services",Current,Unadjusted,NaN

In [31]:
type(df['Period'])

pandas.core.series.Series

In [32]:
type(df)

pandas.core.frame.DataFrame

In [38]:
df.dtypes

(5955, 14)

In [34]:
df.describe()

            Period    Data_value  Magnitude  Series_title_5
count  5955.000000   5600.000000     5955.0             0.0
mean   2018.973159   4725.778359        6.0             NaN
std       1.827219   6886.030728        0.0             NaN
min    2016.060000   -398.194000        6.0             NaN
25%    2017.120000    657.659750        6.0             NaN
50%    2019.060000   2110.092000        6.0             NaN
75%    2020.120000   4502.628250        6.0             NaN
max    2022.060000  37508.973000        6.0             NaN

In [36]:
df['Data_value'].mean()

4725.778359285714

In [37]:
df['Data_value'].std()

6886.030727838974

In [41]:
df['Period']

0       2016.06
1       2016.09
2       2016.12
3       2017.03
4       2017.06
         ...
5950    2021.06
5951    2021.09
5952    2021.12
5953    2022.03
5954    2022.06
Name: Period, Length: 5955, dtype: float64

In [103]:
def float_to_date(x):
    datetime.date(
        int(str(x)[0:4]),
        int(str(x)[5:7]),
        1
    )

In [89]:
lambda x : datetime.date(int(str(x)[0:4]),int(str(x)[5:7]),1)

In [101]:
df['Period_Date'] = df['Period'].map(float_to_date)

In [102]:
df['Period_Date']

0       None
1       None
2       None
3       None
4       None
        ...
5950    None
5951    None
5952    None
5953    None
5954    None
Name: Period_Date, Length: 5955, dtype: object